// pages/software/software.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    "title":"上海海洋大学信息学院软件工程专业欢迎你",
    "introduce":" ●上海海洋大学信息学院本着“创新、协同、开放”的办学理念，依托学校海洋领域学科优势，聚焦于海洋应用领域的核心计算机科学理论与技术，逐步形成了智慧海洋、智能渔业、通讯导航和智能计算为特色的学科方向。\n●现有计算机科学与技术、软件工程2个一级学科硕士点，1个计算机技术工程硕士点，计算机科学与技术、软件工程、信息与计算科学和空间信息与数字技术4个本科专业。学院先后与美国加州大学、英国爱丁堡龙比亚大学开展国际合作办学。\n●拥有农业部渔业信息重点实验室、与国家海洋局东海分局共建的数字海洋研究所、上海市数字农业工程技术研究中心、上海农业物联网工程技术研究中心等省部级平台。\n●学院主持和参与了国家863、973计划、科技部支撑计划、国家“数字海洋”示范区建设项目、国家海洋行业专项、国家自然科学基金等多项国家级项目。获上海市科技进步二等奖2项；上海市技术发明奖二等奖1项，三等奖2项；中国产学研特等奖1项；上海海洋科技进步奖一等奖1项，上海市优质在线课程1门，上海市全英语示范课程2门，获上海市教学成果一等奖、二等奖各1项。",
    "title1":"办学定位",
    "para1":"系统地学习软件开发、尤其是移动应用开发以及软件工程项目管理的理论、技术和方法。培养能胜任企事业单位的软件需求分析、软件项目管理、软件开发、软件测试、软件实施与软件维护、部署等岗位，具有良好合作精神的专业软件工程师。",
    "title2":"师资力量",
    teacher_info:[{
      "img":"https://6d79-mywebapp-7bmzs-1302514864.tcb.qcloud.la/images/yhc.jpg?sign=ce0fc54e227ba6b263250d36a3bb77a6&t=1593268302",
      "name":"袁红春",
      "teacherIntro":"博士，教授，信息学院副院长，毕业于中国科学技术大学模式识别与智能系统专业。",
      "majarContent":"2012-2014年，主持上海市科委项目“近岸海域环境自动监测与灾害预警关键技术研究。\n2014-2017年，主持上海市科委项目“基于物联网技术的水产品溯源与安全预警平台建设及应用示范。",
      "teachContent":"《面向对象程序设计》、《算法设计与分析》、《信息系统项目管理》、《人工神经网络原理及应用》等"
    },
    {
      "img":"https://6d79-mywebapp-7bmzs-1302514864.tcb.qcloud.la/images/hq.jpg?sign=3a47f213cbf59622f93f7367caa427d5&t=1593268315",
      "name":"贺琪",
      "teacherIntro":"复旦大学计算机软件与理论博士，中国计算机学会（CCF）上海委员。近年在多模态海洋遥感影像分类、海洋时序数据分析等方面取得新的成果，发表在《Compters Materials & Continua》等期刊，以及APWeb和IJCNN 等国际会议上。",
      "majarContent":"国家自然科学基金项目 ‘数字海洋’中海量复杂类型数据的质量检验及存储问题研究国家自然科学基金项目 “SOA的等级化服务替换理论与机制研究”遥感影像分类，海洋大数据分析，工作流与业务流程管理等。",
      "teachContent":"《面向对象程序设计》、《算法设计与分析》、《信息系统项目管理》、《人工神经网络原理及应用》等"
    },
    {
      "img":"https://6d79-mywebapp-7bmzs-1302514864.tcb.qcloud.la/images/sw.jpg?sign=df314a6b64da75dda65edbcf16ebbd77&t=1593268333",
      "name":"宋巍",
      "teacherIntro":"博士，上海市“东方学者”特聘教授，任澳大利亚格里菲斯大学客座研究员，ACM和IEEE会员，IEEE TMM、ACM TOMM、JSEKE、MMS等国际期刊评审，QCMan国际会议技术程序委员会委员和OZCHI会议程序委员会委员。",
      "majarContent":"数字海洋",
      "teachContent":"《软件工程综合实践》、《软件工程需求分析》、《移动计算与应用开发基础》、《移动应用开发技术》、《高级多媒体系统》等"
    }]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})